# Create Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
MechanicalEquipmentSetType..::..Create Method
MechanicalEquipmentSetType Class See Also
---
Creates a new type of a mechanical equipment set and adds it to the document.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static MechanicalEquipmentSetType Create(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As MechanicalEquipmentSetType
```

Visual C++
---
```text
public:
static MechanicalEquipmentSetType^ Create(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document where the new type is created.
name
    Type: System..::..String The name of new type.
# ### Return Value
The newly created mechanical equipment set type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name cannot include prohibited characters. -or- name is an empty string. -or- The given name is not unique |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document has no open transaction. |

# See Also
MechanicalEquipmentSetType Class
Autodesk.Revit.DB.Mechanical Namespace